{
  "moduleId": "custom-hooks-utility-belt",
  "fiction": {
    "title": "Batman (DC Comics)",
    "author": "Bob Kane, Bill Finger",
    "year": 1939,
    "type": "comic-book",
    "genre": ["superhero", "crime-fighter", "noir"],
    "keyElements": [
      "Batman",
      "Bruce Wayne",
      "Utility Belt",
      "Grapple Gun",
      "Smoke Bomb",
      "Batcave",
      "Alfred Pennyworth",
      "Gotham City",
      "GCPD",
      "Commissioner Gordon"
    ]
  },
  "metaphor": {
    "core": "Batman's utility belt, filled with specialized gadgets that encapsulate complex functionalities into reusable tools, serves as a metaphor for custom React hooks. Custom hooks allow developers to extract and reuse stateful logic across multiple components, streamlining development and preventing code duplication, much like Batman's gadgets solve repeatable problems efficiently.",
    "mapping": [
      {
        "fictionElement": "Utility Belt",
        "reactConcept": "Collection of custom hooks"
      },
      {
        "fictionElement": "Grapple Gun (complex ascent in one fluid action)",
        "reactConcept": "A custom hook (`useGrapple`) encapsulating complex stateful logic (animation, timers, state management) into a single, reusable function"
      },
      {
        "fictionElement": "Smoke Bomb (visibility management)",
        "reactConcept": "A custom hook (`useSmokeBomb`) encapsulating related state and logic for a specific UI concern"
      },
      {
        "fictionElement": "Building a solution 'on the fire escape' (raw rope, clumsy ascent)",
        "reactConcept": "Duplicating stateful logic directly within components, leading to code repetition, maintenance issues, and potential bugs (e.g., memory leaks from unmanaged effects)"
      },
      {
        "fictionElement": "Building solutions 'in the Batcave' (Alfred Principle)",
        "reactConcept": "Extracting common stateful logic into custom hooks, centralizing development and ensuring reliability"
      },
      {
        "fictionElement": "The 'Tale of Two Climbs' (young vs. veteran Batman)",
        "reactConcept": "The contrast between inefficient, duplicated logic and efficient, reusable custom hook implementation for common tasks"
      }
    ],
    "narrativeArc": "The module takes us through Batman's evolution from a less efficient crime-fighter struggling with raw tools (duplicated, stateful logic) to the masterful detective who leverages a well-equipped utility belt (custom hooks). It highlights the pain points of code duplication and mismanagement, introduces the 'Alfred Principle' of extracting reusable solutions, compares inefficient and efficient approaches, and culminates in showing how composing custom hooks builds a robust system."
  },
  "concepts": {
    "primary": "Custom Hooks",
    "secondary": [
      "Code Reusability",
      "Stateful Logic Extraction",
      "Preventing Duplication",
      "Managing Side Effects",
      "useEffect Cleanup",
      "Separation of Concerns",
      "Hook Composition"
    ],
    "problems": [
      "Code duplication across components for similar logic",
      "Difficulty in sharing stateful logic without prop drilling or context overuse",
      "Memory leaks due to improper cleanup in duplicated effects"
    ],
    "reactAPIs": ["useState", "useEffect", "useCallback", "useRef"]
  },
  "structure": {
    "format": "chapter-based",
    "chapters": [
      {
        "title": "The Arsenal in Action",
        "focus": "Introduces custom hooks as tools encapsulating complex, reusable logic."
      },
      {
        "title": "The Price of Reinvention",
        "focus": "Demonstrates the problems and inefficiencies of duplicating stateful logic directly within components."
      },
      {
        "title": "The Alfred Principle",
        "focus": "Explains the motivation behind custom hooks: extracting repeatable problems into reusable solutions."
      },
      {
        "title": "The Tale of Two Climbs",
        "focus": "Compares the messy, inefficient approach of duplicated logic versus the clean, efficient use of custom hooks."
      },
      {
        "title": "The Belt Is The System",
        "focus": "Illustrates how custom hooks compose to form a robust and maintainable application system."
      }
    ],
    "pedagogicalApproach": "narrative|problem-solution|contrast-driven|progressive",
    "interactiveElements": [
      "Demonstrating custom hooks like `useGrapple` and `useSmokeBomb` in action",
      "Illustrating duplicated stateful logic and its inefficiencies (e.g., `BrokenWindowTracker`)",
      "Interactive memory leak demonstration (buggy vs. fixed with cleanup)",
      "Visual comparison of components using duplicated logic versus custom hooks",
      "Showing multiple custom hooks composed within a single component"
    ]
  },
  "search": {
    "keywords": [
      "React Custom Hooks",
      "React Hooks Tutorial",
      "Reusability React",
      "Extract Logic React",
      "useState useEffect Custom Hooks",
      "React Code Duplication",
      "React Stateful Logic",
      "React Hook Best Practices",
      "Batman React Hooks",
      "Utility Belt Hooks",
      "Batman",
      "DC Comics"
    ],
    "themes": ["hooks", "code reusability", "state management", "architecture", "performance"],
    "difficulty": "intermediate",
    "prerequisites": [],
    "relatedModules": []
  }
}