{
  "moduleId": "portals-the-wardrobe-in-the-spare-room",
  "fiction": {
    "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
    "author": "C.S. Lewis",
    "year": 1950,
    "type": "novel",
    "genre": ["fantasy", "children's literature"],
    "keyElements": [
      "Lucy Pevensie",
      "Professor's House",
      "Spare Room",
      "Wardrobe",
      "Narnia",
      "Narnia Map",
      "Lion (Aslan, implied by roaring)",
      "CSS Constraints (z-index, overflow, position)"
    ]
  },
  "metaphor": {
    "core": "The magical wardrobe in the spare room that leads to Narnia serves as a metaphor for React Portals. Just as the wardrobe provides a passage to a different world, allowing grand items like the Narnia Map to escape the cramped confines and CSS constraints of the spare room, React Portals (`createPortal`) enable components to render their children into a different DOM node outside the parent component's hierarchy, while maintaining their logical React tree relationship for event bubbling and state management.",
    "mapping": [
      {
        "fictionElement": "Professor's House (a sprawling component tree)",
        "reactConcept": "The main React application component hierarchy."
      },
      {
        "fictionElement": "Cramped Spare Room (with CSS constraints)",
        "reactConcept": "A parent React component whose styling (e.g., `overflow: hidden`, `z-index`, `position: relative`) inadvertently clips, obscures, or restricts the display of its child components."
      },
      {
        "fictionElement": "Grand Map of Narnia",
        "reactConcept": "A child React component (e.g., a modal, tooltip, dropdown) that needs to be displayed outside the visual boundaries or stacking context of its parent to function correctly or provide a better user experience."
      },
      {
        "fictionElement": "Dust sheet obscuring the map (z-index problem)",
        "reactConcept": "A component being incorrectly layered due to `z-index` conflicts with parent or sibling elements."
      },
      {
        "fictionElement": "Map edges vanishing (overflow: hidden)",
        "reactConcept": "A component's content being clipped by a parent's `overflow: hidden` style."
      },
      {
        "fictionElement": "Wardrobe opening to Narnia",
        "reactConcept": "`React.createPortal()`: the function that allows rendering a child component into a different DOM node."
      },
      {
        "fictionElement": "Map unfurling to full size in Narnia's vast clearing",
        "reactConcept": "A portal'd component rendering free from the layout and styling constraints of its logical parent, allowing it to be displayed correctly (e.g., full-screen modal, tooltip floating over other elements)."
      },
      {
        "fictionElement": "Lion's roar echoing back through the wardrobe",
        "reactConcept": "Event bubbling: events from a portal'd component still propagate up through its logical React component hierarchy, even though its DOM placement is different."
      }
    ],
    "narrativeArc": "The module follows Lucy's frustration with displaying the 'Grand Map of Narnia' in the 'cramped spare room' due to CSS constraints (z-index, overflow, position). This problem is resolved by discovering the 'wardrobe' (React Portal) which allows the map to render in 'a different world' (outside the parent's DOM hierarchy). The narrative then highlights how event bubbling still connects the 'two worlds' and concludes with Lucy becoming a 'master of the passages', applying portals to various common UI problems like modals and tooltips."
  },
  "concepts": {
    "primary": "React Portals (`createPortal`)",
    "secondary": [
      "DOM Hierarchy",
      "Component Tree",
      "CSS Stacking Context",
      "Overflow Issues",
      "Modals",
      "Tooltips",
      "Event Bubbling",
      "Logical vs. Physical Placement"
    ],
    "problems": [
      "Child components being clipped, obscured, or constrained by parent component's CSS styles (e.g., `overflow: hidden`, `z-index`, `position`)",
      "Difficulty in rendering overlays (modals, tooltips) that need to appear above all other content without affecting parent layout",
      "Maintaining event bubbling while rendering content outside parent DOM."
    ],
    "reactAPIs": ["createPortal", "useState", "useEffect", "useRef", "ReactDOM"]
  },
  "structure": {
    "format": "chapter-based",
    "chapters": [
      {
        "title": "The Grand Map and the Cramped Room",
        "focus": "Introduces the problem of a child component needing to visually escape the confines of its parent's styling."
      },
      {
        "title": "The Walls Have Rules",
        "focus": "Demonstrates specific CSS constraints (z-index, overflow, position) that trap child components within their parent's visual boundaries."
      },
      {
        "title": "A Door to a Different World",
        "focus": "Explains and demonstrates `React.createPortal()` as the solution for rendering components into a different DOM node."
      },
      {
        "title": "Two Worlds, One Story",
        "focus": "Highlights how components rendered via portals maintain their logical React tree relationship, ensuring event bubbling still works as expected."
      },
      {
        "title": "Master of the Passages",
        "focus": "Explores practical use cases for React Portals, such as modals, tooltips, and other overlay UI components."
      }
    ],
    "pedagogicalApproach": "narrative|problem-solution|contrast-driven|progressive",
    "interactiveElements": [
      "Interactive demonstration of a child component (Narnia map) being clipped/obscured by various parent CSS properties (z-index, overflow)",
      "Toggle between a 'trapped' mode (no portal) and 'free' mode (using portal) to show visual differences",
      "Triggering events on a portal'd component to demonstrate event bubbling back to the logical parent",
      "Interactive examples of portal-based tooltips and other overlay UI elements."
    ]
  },
  "search": {
    "keywords": [
      "React Portals",
      "createPortal React",
      "React Modals",
      "React Tooltips",
      "React Dropdowns",
      "Escape Parent CSS React",
      "DOM Hierarchy React",
      "Event Bubbling Portals",
      "Narnia React",
      "C.S. Lewis Portals"
    ],
    "themes": ["DOM manipulation", "UI overlays", "component rendering", "CSS issues", "event handling"],
    "difficulty": "intermediate",
    "prerequisites": [],
    "relatedModules": []
  }
}